nxp-mcuxpresso/mcux-soc-svd/KW45Z41052/KW45Z41052.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>LPTMR0</name>
      <description>LPTMR</description>
      <groupName>LPTMR</groupName>
      <headerStructName>LPTMR</headerStructName>
      <baseAddress>0x4002D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPTMR0</name>
        <value>34</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>Control Status</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEN</name>
              <description>Timer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ten0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ten1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMS</name>
              <description>Timer Mode Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tms0</name>
                  <description>Time Counter mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tms1</name>
                  <description>Pulse Counter mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFC</name>
              <description>Timer Free-Running Counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tfc0</name>
                  <description>Reset if TCF set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tfc1</name>
                  <description>Reset on overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPP</name>
              <description>Timer Pin Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tpp0</name>
                  <description>Active-high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tpp1</name>
                  <description>Active-low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS</name>
              <description>Timer Pin Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tps00</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tps01</name>
                  <description>Input 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tps10</name>
                  <description>Input 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tps11</name>
                  <description>Input 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIE</name>
              <description>Timer Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tie0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tie1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCF</name>
              <description>Timer Compare Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tcf0</name>
                  <description>CNR != (CMR + 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tcf1</name>
                  <description>CNR = (CMR + 1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDRE</name>
              <description>Timer DMA Request Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>trde0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trde1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSR</name>
          <description>Prescale and Glitch Filter</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PCS</name>
              <description>Prescaler/Glitch Filter Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcs00</name>
                  <description>Clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcs01</name>
                  <description>Clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcs10</name>
                  <description>Clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcs11</name>
                  <description>Clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBYP</name>
              <description>Prescaler/Glitch Filter Bypass</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pbyp0</name>
                  <description>Prescaler/glitch filter enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pbyp1</name>
                  <description>Prescaler/glitch filter bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Prescale/Glitch Filter Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>prescale0000</name>
                  <description>Prescaler divides the prescaler clock by 2; glitch filter does not support this configuration.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0001</name>
                  <description>Prescaler divides the prescaler clock by 4; glitch filter recognizes change on input pin after 2 rising clock edges.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0010</name>
                  <description>Prescaler divides the prescaler clock by 8; glitch filter recognizes change on input pin after 4 rising clock edges.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0011</name>
                  <description>Prescaler divides the prescaler clock by 16; glitch filter recognizes change on input pin after 8 rising clock edges.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0100</name>
                  <description>Prescaler divides the prescaler clock by 32; glitch filter recognizes change on input pin after 16 rising clock edges.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0101</name>
                  <description>Prescaler divides the prescaler clock by 64; glitch filter recognizes change on input pin after 32 rising clock edges.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0110</name>
                  <description>Prescaler divides the prescaler clock by 128; glitch filter recognizes change on input pin after 64 rising clock edges.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale0111</name>
                  <description>Prescaler divides the prescaler clock by 256; glitch filter recognizes change on input pin after 128 rising clock edges.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1000</name>
                  <description>Prescaler divides the prescaler clock by 512; glitch filter recognizes change on input pin after 256 rising clock edges.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1001</name>
                  <description>Prescaler divides the prescaler clock by 1024; glitch filter recognizes change on input pin after 512 rising clock edges.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1010</name>
                  <description>Prescaler divides the prescaler clock by 2048; glitch filter recognizes change on input pin after 1024 rising clock edges.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1011</name>
                  <description>Prescaler divides the prescaler clock by 4096; glitch filter recognizes change on input pin after 2048 rising clock edges.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1100</name>
                  <description>Prescaler divides the prescaler clock by 8192; glitch filter recognizes change on input pin after 4096 rising clock edges.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1101</name>
                  <description>Prescaler divides the prescaler clock by 16,384; glitch filter recognizes change on input pin after 8192 rising clock edges.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1110</name>
                  <description>Prescaler divides the prescaler clock by 32,768; glitch filter recognizes change on input pin after 16,384 rising clock edges.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>prescale1111</name>
                  <description>Prescaler divides the prescaler clock by 65,536; glitch filter recognizes change on input pin after 32,768 rising clock edges.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMR</name>
          <description>Compare</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARE</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNR</name>
          <description>Counter</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
