nxp-mcuxpresso/mcux-soc-svd/KW45Z41052/KW45Z41052.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MCM</name>
      <description>MCM</description>
      <groupName>MCM</groupName>
      <baseAddress>0xE0080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4A8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MCM0</name>
        <value>19</value>
      </interrupt>
      <registers>
        <register>
          <name>CPCR</name>
          <description>Core Platform Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFE00</resetMask>
          <fields>
            <field>
              <name>CBRR</name>
              <description>Crossbar Round-robin Arbitration Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cbrr0</name>
                  <description>Fixed-priority arbitration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cbrr1</name>
                  <description>Round-robin arbitration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLEXSTALL</name>
              <description>Flash Stall Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pflexstall0</name>
                  <description>Flash stall is disabled when flash is busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pflexstall1</name>
                  <description>Flash stall is enabled when flash is busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISCR</name>
          <description>Interrupt Status and Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWBER</name>
              <description>Cache Write Buffer Error Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cwber0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cwber1</name>
                  <description>Error occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPES</name>
              <description>Cache Parity Error Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cpes0</name>
                  <description>A cache parity error is not detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cpes1</name>
                  <description>A cache parity error is detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIOC</name>
              <description>FPU Invalid Operation Interrupt Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fioc0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fioc1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDZC</name>
              <description>FPU Divide-by-zero Interrupt Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fdzc0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fdzc1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFC</name>
              <description>FPU Overflow Interrupt Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fofc0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fofc1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUFC</name>
              <description>FPU Underflow Interrupt status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fufc0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fufc1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXC</name>
              <description>FPU Inexact Interrupt Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fixc0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fixc1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIDC</name>
              <description>FPU Input Denormal Interrupt Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fidc0</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fidc1</name>
                  <description>Interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWBEE</name>
              <description>Cache Write Buffer Error Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cwbee0</name>
                  <description>Disable error interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cwbee1</name>
                  <description>Enable error interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPEE</name>
              <description>Cache Parity Error Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cpee0</name>
                  <description>Disable error interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cpee1</name>
                  <description>Enable error interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIOCE</name>
              <description>FPU Invalid Operation Interrupt Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fioce0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fioce1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDZCE</name>
              <description>FPU Divide-by-zero Interrupt Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fdzce0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fdzce1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOFCE</name>
              <description>FPU Overflow Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fofce0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fofce1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FUFCE</name>
              <description>FPU Underflow Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fufce0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fufce1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXCE</name>
              <description>FPU Inexact Interrupt Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fixce0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fixce1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIDCE</name>
              <description>FPU Input Denormal Interrupt Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fidce0</name>
                  <description>Disable interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fidce1</name>
                  <description>Enable interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FADR</name>
          <description>Write Buffer Fault Address</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Fault address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FATR</name>
          <description>Store Buffer Fault Attributes</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BEDA</name>
              <description>Bus Error Data Access Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>beda0</name>
                  <description>Instruction</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>beda1</name>
                  <description>Data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEMD</name>
              <description>Bus Error Privilege level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bemd0</name>
                  <description>User mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bemd1</name>
                  <description>Supervisor/privileged mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BESZ</name>
              <description>Bus Error Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>besz00</name>
                  <description>8-bit access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>besz01</name>
                  <description>16-bit access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>besz10</name>
                  <description>32-bit access</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEWT</name>
              <description>Bus Error Write</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bewt0</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bewt1</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEMN</name>
              <description>Bus Error Master Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BEOVR</name>
              <description>Bus Error Overrun</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>beovr0</name>
                  <description>No bus error overrun</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>beovr1</name>
                  <description>Bus error overrun occurred. The FADR and FDR registers and the other FATR bits will not be updated to reflect this new bus error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDR</name>
          <description>Store Buffer Fault Data</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Fault Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
